src/Catalogs/кфкСпецификации/кфкСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкСпецификации</name>
  <owners>Catalog.кфкПриложенияСпецификаций</owners>
  <attributes>
    <name>АдресТопика</name>
    <comment>channels.{ИмяКанала}.address: {АдресТопика}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКанала</name>
    <comment>channels.{ИмяКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперации</name>
    <comment>operations.{ИмяОперации}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщения</name>
    <comment>components.messages.{ИмяСообщения}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщенияКанала</name>
    <comment>channels.{ИмяКанала}.messages.{ИмяСообщенияКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСхемы</name>
    <comment>components.schemas.{ИмяСхемы}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/кфкИзмененияОбъектовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИзмененияОбъектовСпецификаций</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.кфкВидыИзмененияДанных</types>
    </type>
  </resources>
  <resources>
    <name>ВидПовышения</name>
    <type>
      <types>EnumRef.кфкВидыПовышенияВерсий</types>
    </type>
  </resources>
  <attributes>
    <name>БазоваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.кфкКомпонентСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкВидыПовышенияВерсий/кфкВидыПовышенияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыПовышенияВерсий</name>
  <enumValues>
    <name>ОсновнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ДополняющаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ВерсияИсправления</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	ИндексыПовышения = ВидыПовышения.Индексы();
	Результат = 9;
	
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда // Новый объект или удаление старого объекта
		Если ЭтоНовый Тогда
			Если История.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда
				ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
				
			ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Изменение Тогда
				ВидПовышения = ?(
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(История.ДанныеВерсии, "ПометкаУдаления", Ложь),
					ВидыПовышения.ПустаяСсылка(), ВидыПовышения.ОсновнаяВерсия);
				
			Иначе
				ВидПовышения = ВидыПовышения.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый сценарий изменения!'");
			
		КонецЕсли;
		Результат = ИндексыПовышения.Найти(ВидПовышения);
		
	Иначе
		Для Каждого КлючЗначение Из История Цикл
			ИмяРеквизита = КлючЗначение.Ключ;
//			Изменения = КлючЗначение.Значение;
			
			Если ИмяРеквизита = "ПометкаУдаления"
					Или ИмяРеквизита = "АдресТопика" Тогда
				ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "ПравилаОбмена" Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "Наименование"  Или ИмяРеквизита = "ИмяСхемы"
					Или ИмяРеквизита = "ИмяКанала" Или ИмяРеквизита = "ИмяОперации"
					Или ИмяРеквизита = "ИмяСообщения" Или ИмяРеквизита = "ИмяСообщенияКанала" Тогда
				ВидПовышения = ВидыПовышения.ВерсияИсправления;
				
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
			КонецЕсли;
			
			Результат = Мин(Результат, ИндексыПовышения.Найти(ВидПовышения));
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(Результат = 9, -1, Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
